In [7]:
#Data structures
import pandas as pd
import numpy as np

In [8]:
#Series
# converting tuple to Series
h = ('AA', '2012-02-01', 100, 10.2)
s = pd.Series(h)
type(s)

pandas.core.series.Series

In [9]:
print(s)

0            AA
1    2012-02-01
2           100
3          10.2
dtype: object

In [10]:
# converting dict to Series
d = {'name' : 'IBM', 'date' : '2010-09-08', 'shares' : 100, 'price' : 10.2}
ds = pd.Series(d)
type(ds)

pandas.core.series.Series

In [11]:
print(ds)

name             IBM
date      2010-09-08
shares           100
price           10.2
dtype: object

In [12]:
f = ['FB', '2001-08-02', 90, 3.2]
f = pd.Series(f, index = ['name', 'date', 'shares', 'price'])
print(f)

name              FB
date      2001-08-02
shares            90
price            3.2
dtype: object

In [13]:
f['shares']

90

In [14]:
f[0]

'FB'

In [15]:
f[['shares', 'price']]

shares     90
price     3.2
dtype: object

In [16]:
#Day 8
#Creating series from scalar
s = pd.Series(50, index=[0,1,2,3,4])
print(s)

0    50
1    50
2    50
3    50
4    50
dtype: int64

In [17]:
#Mathematical Operations in Series
s = pd.Series([1,2,3,4,5])
print("To multiply all values in the series by 2")
print("------------------------------------------")
print(s*2)
print("To find the square of all values in the series")
print("------------------------------------------")
print(s**2)
print("To print all values in a series that are greater than 2")
print("------------------------------------------")
print(s[s>2])

To multiply all values in the series by 2
------------------------------------------
0     2
1     4
2     6
3     8
4    10
dtype: int64
To find the square of all values in the series
------------------------------------------
0     1
1     4
2     9
3    16
4    25
dtype: int64
To print all values in a series that are greater than 2
------------------------------------------
2    3
3    4
4    5
dtype: int64

In [18]:
s1 = pd.Series([1,2,3,4,5], index= ['a','b','c','d','e'])
s2 = pd.Series([10,20,30,40,50], index= ['a','b','c','d','e'])
s3 = pd.Series([5,14,23,32], index= ['a','b','c','d'])
print("To add Series1 & series2")
print("------------------------------------------")
print(s1+s2)
print("To add Series2 & series3")
print("------------------------------------------")
print(s2+s3)
print("To add Series2 & series3 and Filled Non Matching Index with 0")
print("------------------------------------------")
print(s2.add(s3,fill_value=0))

To add Series1 & series2
------------------------------------------
a    11
b    22
c    33
d    44
e    55
dtype: int64
To add Series2 & series3
------------------------------------------
a    15.0
b    34.0
c    53.0
d    72.0
e     NaN
dtype: float64
To add Series2 & series3 and Filled Non Matching Index with 0
------------------------------------------
a    15.0
b    34.0
c    53.0
d    72.0
e    50.0
dtype: float64

In [19]:
#selecting in series
arr = np.array([10,15,18,22,55,77])
s = pd.Series(arr)
print(s)
print("------------------------")
print(s.loc[:2])
print(s.iloc[:2])

print("------------------------")
print(s.loc[3:4])
print(s.iloc[3:4])
print("------------------------")
s.loc[2:3]
print("------------------------")
s.iloc[2:3]
print(s[1])
print("\n")
print(s[3:4])
s[:3]

0    10
1    15
2    18
3    22
4    55
5    77
dtype: int32
------------------------
0    10
1    15
2    18
dtype: int32
0    10
1    15
dtype: int32
------------------------
3    22
4    55
dtype: int32
3    22
dtype: int32
------------------------
------------------------
15


3    22
dtype: int32

0    10
1    15
2    18
dtype: int32

In [20]:
#Indexing in Series
arr= np.array(['a','b','c','d'])
s = pd.Series(arr,index=['first','second','third','fourth'])
print(s)
#To print only indexes in series
print('\n indexes in Series are:::')
s.index

first     a
second    b
third     c
fourth    d
dtype: object

 indexes in Series are:::

Index(['first', 'second', 'third', 'fourth'], dtype='object')

In [21]:
#Slicing in Series
arr = np.array([10,15,18,22,55,77])
s = pd.Series(arr, index=['A','B','C','D','E','F'])
print(s)
print(s[1:5:2])
print(s[0:6:2])

A    10
B    15
C    18
D    22
E    55
F    77
dtype: int32
B    15
D    22
dtype: int32
A    10
C    18
E    55
dtype: int32

In [22]:
#Dataframes
#How to create Dataframe From dict
data = { 'name' : ['AA', 'IBM', 'GOOG'],
'date' : ['2001-12-01', '2012-02-10', '2010-04-09'],
'shares' : [100, 30, 90],
'price' : [12.3, 10.3, 32.2]
}
df = pd.DataFrame(data)
type(df)

pandas.core.frame.DataFrame

In [23]:
df

   name        date  shares  price
0    AA  2001-12-01     100   12.3
1   IBM  2012-02-10      30   10.3
2  GOOG  2010-04-09      90   32.2

In [24]:
#adding a new column
df['owner']= 'Unknown'
df

   name        date  shares  price    owner
0    AA  2001-12-01     100   12.3  Unknown
1   IBM  2012-02-10      30   10.3  Unknown
2  GOOG  2010-04-09      90   32.2  Unknown

In [25]:
#changing the indexing
df.index=['one','two','three']
df

       name        date  shares  price    owner
one      AA  2001-12-01     100   12.3  Unknown
two     IBM  2012-02-10      30   10.3  Unknown
three  GOOG  2010-04-09      90   32.2  Unknown

In [26]:
df= df.set_index(['name'])
df

            date  shares  price    owner
name
AA    2001-12-01     100   12.3  Unknown
IBM   2012-02-10      30   10.3  Unknown
GOOG  2010-04-09      90   32.2  Unknown

In [27]:
# access data using column-index
df['shares']

name
AA      100
IBM      30
GOOG     90
Name: shares, dtype: int64

In [28]:
#Day 9
# creating an empty dataframe
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [29]:
#How to create Dataframe From Series
s = pd.Series(['a','b','c','d'])
df = pd.DataFrame(s)
print(df)

   0
0  a
1  b
2  c
3  d

In [30]:
#Iteration on Rows and Columns
l = [{'Name' : 'Agnes', 'SurName' : 'Murigi'},
    {'Name' : 'San', 'SurName' : 'Verma'}]
df1 = pd.DataFrame(l)
print(df1)
for(row_index,row_value) in df1.iterrows():
    print('\n Row index is ::',row_index)
    print("Row value is ::")
    print(row_value)

    Name SurName
0  Agnes  Murigi
1    San   Verma

 Row index is :: 0
Row value is ::
Name        Agnes
SurName    Murigi
Name: 0, dtype: object

 Row index is :: 1
Row value is ::
Name         San
SurName    Verma
Name: 1, dtype: object

In [31]:
l = [{'Name' : 'Agnes', 'SurName' : 'Murigi'},
    {'Name' : 'San', 'SurName' : 'Verma'}]
df1 = pd.DataFrame(l)
print(df1)
for(col_index,col_value) in df1.iteritems():
    print('\n Column Name is ::',col_index)
    print("Column values are ::")
    print(col_value)

    Name SurName
0  Agnes  Murigi
1    San   Verma

 Column Name is :: Name
Column values are ::
0    Agnes
1      San
Name: Name, dtype: object

 Column Name is :: SurName
Column values are ::
0    Murigi
1     Verma
Name: SurName, dtype: object

C:\Users\user\AppData\Local\Temp\ipykernel_12456\2632520963.py:5: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for(col_index,col_value) in df1.iteritems():

In [32]:
#Select operation in data frame (df[empid])
data = { 'name' : ['AA', 'IBM', 'GOOG'],
'date' : ['2001-12-01', '2012-02-10', '2010-04-09'],
'shares' : [100, 30, 90],
'price' : [12.3, 10.3, 32.2]
}
df = pd.DataFrame(data)
print(df)

   name        date  shares  price
0    AA  2001-12-01     100   12.3
1   IBM  2012-02-10      30   10.3
2  GOOG  2010-04-09      90   32.2

In [33]:
df['name']

0      AA
1     IBM
2    GOOG
Name: name, dtype: object

In [34]:
df[['name','date']]

   name        date
0    AA  2001-12-01
1   IBM  2012-02-10
2  GOOG  2010-04-09

In [35]:
#To Add & Rename a column in dataframe
s = pd.Series([10,15,18,22])
df=pd.DataFrame(s)
df.columns=['List1'] 
df['List2']=20 
df['List3']=df['List1']+df['List2']

print(df)

   List1  List2  List3
0     10     20     30
1     15     20     35
2     18     20     38
3     22     20     42

In [36]:
#To Delete a Column in data frame
del df['List3']
print(df)

   List1  List2
0     10     20
1     15     20
2     18     20
3     22     20

In [37]:
df.pop('List2')
print(df)

   List1
0     10
1     15
2     18
3     22

In [38]:
#To Delete a Column Using drop()
s= pd.Series([10,20,30,40])
df=pd.DataFrame(s)
df.columns=['List1']
df['List2']=40
df1=df.drop('List2',axis=1) #(axis=1) means to delete Data column wise
df2=df.drop(index=[2,3],axis=0) #(axis=0) #means to delete data row wise with given index
print(df)
print('After deletion::')
print(df1)
print (' After row deletion::')
print(df2)

   List1  List2
0     10     40
1     20     40
2     30     40
3     40     40
After deletion::
   List1
0     10
1     20
2     30
3     40
 After row deletion::
   List1  List2
0     10     40
1     20     40

In [39]:
#Day 10
#Reading files
casts = pd.read_csv(r'C:/Users/user/Desktop/Numpy/pythondsp-pandasguide-b936c3b43406/data/cast.csv', index_col=None)
casts.head()
#nb fix the csv error

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [42]:
titles = pd.read_csv(r'C:\Users\user\Desktop\Numpy\pythondsp-pandasguide-b936c3b43406\data\titles.csv', index_col=None, encoding='utf-8')

titles.tail()

                      title  year
49995                 Rebel  1970
49996               Suzanne  1996
49997                 Bomba  2013
49998  Aao Jao Ghar Tumhara  1984
49999            Mrs. Munck  1995

In [63]:
pd.set_option('max_rows', 10, 'max_columns', 10)
print(titles)

OptionError: Pattern matched multiple keys

In [45]:
len(titles)

50000

In [46]:
titles.head(3)

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993

In [47]:
# Data operations
#  Row and column selection
t = titles['title']
type(t)

pandas.core.series.Series

In [48]:
t.head()

0             The Rising Son
1    The Thousand Plane Raid
2           Crucea de piatra
3                    Country
4                 Gaiking II
Name: title, dtype: object

In [49]:
titles.ix[0]

AttributeError: 'DataFrame' object has no attribute 'ix'

In [50]:
# Filter Data
# movies after 1985
after85 = titles[titles['year'] > 1985]
after85.head()

              title  year
0    The Rising Son  1990
2  Crucea de piatra  1993
3           Country  2000
4        Gaiking II  2011
5       Medusa (IV)  2015

In [51]:
# display movie in years 1990 - 1999
t = titles
movies90 = t[ (t['year']>=1990) & (t['year']<2000) ]
movies90.head()

                       title  year
0             The Rising Son  1990
2           Crucea de piatra  1993
12  Poka Makorer Ghar Bosoti  1996
19          Maa Durga Shakti  1999
24      Conflict of Interest  1993

In [52]:
#Sorting
# find all movies named as 'Macbeth'
t = titles
macbeth = t[ t['title'] == 'Macbeth']
macbeth.head()

         title  year
4226   Macbeth  1913
9322   Macbeth  2006
11722  Macbeth  2013
17166  Macbeth  1997
25847  Macbeth  1998

In [53]:
# by default, sort by index i.e. row header
macbeth = t[ t['title'] == 'Macbeth'].sort_index()
macbeth.head()

         title  year
4226   Macbeth  1913
9322   Macbeth  2006
11722  Macbeth  2013
17166  Macbeth  1997
25847  Macbeth  1998

In [54]:
# sort by year
macbeth = t[ t['title'] == 'Macbeth'].sort_values('year')
macbeth.head()

         title  year
4226   Macbeth  1913
17166  Macbeth  1997
25847  Macbeth  1998
9322   Macbeth  2006
11722  Macbeth  2013

In [55]:
# Null values
casts.ix[3:4]
c = casts
c['n'].isnull().head()

AttributeError: 'DataFrame' object has no attribute 'ix'

In [60]:
c['n'].notnull().head()

NameError: name 'c' is not defined

In [61]:
c[c['n'].isnull()].head(3)

NameError: name 'c' is not defined

In [59]:
c_fill = c[c['n'].isnull()].fillna('NA')
c_fill.head(2)

NameError: name 'c' is not defined

In [58]:
#String operations
t = titles
t[t['title'] == 'Maa']

      title  year
38880   Maa  1968

In [57]:
t[t['title'].str.startswith("Maa ")].head(3)

                  title  year
19     Maa Durga Shakti  1999
3046      Maa Aur Mamta  1970
7470  Maa Vaibhav Laxmi  1989

In [56]:
# Count Values
t['year'].value_counts().head()

2016    2363
2017    2138
2015    1849
2014    1701
2013    1609
Name: year, dtype: int64